tools/k6/resultats/avant-2026-09-24/palier-5.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/macbookpro/klassio-saas/tools/k6/charge.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m27s max duration (incl. graceful stop):
              * matinee: Up to 5 looping VUs for 1m7s over 3 stages (gracefulRampDown: 20s, gracefulStop: 30s)


running (0m01.0s), 1/5 VUs, 0 complete and 0 interrupted iterations
matinee   [   1% ] 1/5 VUs  0m00.4s/1m07.0s

running (0m02.0s), 1/5 VUs, 0 complete and 0 interrupted iterations
matinee   [   2% ] 1/5 VUs  0m01.4s/1m07.0s

running (0m03.0s), 1/5 VUs, 0 complete and 0 interrupted iterations
matinee   [   4% ] 1/5 VUs  0m02.4s/1m07.0s

running (0m04.0s), 2/5 VUs, 0 complete and 0 interrupted iterations
matinee   [   5% ] 2/5 VUs  0m03.4s/1m07.0s

running (0m05.0s), 2/5 VUs, 0 complete and 0 interrupted iterations
matinee   [   6% ] 2/5 VUs  0m04.3s/1m07.0s

running (0m06.0s), 2/5 VUs, 0 complete and 0 interrupted iterations
matinee   [   8% ] 2/5 VUs  0m05.3s/1m07.0s

running (0m07.0s), 3/5 VUs, 0 complete and 0 interrupted iterations
matinee   [   9% ] 3/5 VUs  0m06.3s/1m07.0s

running (0m08.0s), 3/5 VUs, 1 complete and 0 interrupted iterations
matinee   [  11% ] 3/5 VUs  0m07.3s/1m07.0s

running (0m09.0s), 4/5 VUs, 2 complete and 0 interrupted iterations
matinee   [  12% ] 4/5 VUs  0m08.3s/1m07.0s

running (0m10.0s), 4/5 VUs, 2 complete and 0 interrupted iterations
matinee   [  14% ] 4/5 VUs  0m09.4s/1m07.0s

running (0m11.0s), 4/5 VUs, 3 complete and 0 interrupted iterations
matinee   [  15% ] 4/5 VUs  0m10.4s/1m07.0s

running (0m12.0s), 5/5 VUs, 3 complete and 0 interrupted iterations
matinee   [  17% ] 5/5 VUs  0m11.4s/1m07.0s

running (0m13.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
matinee   [  18% ] 5/5 VUs  0m12.4s/1m07.0s

running (0m14.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
matinee   [  20% ] 5/5 VUs  0m13.3s/1m07.0s

running (0m15.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
matinee   [  21% ] 5/5 VUs  0m14.4s/1m07.0s

running (0m16.0s), 5/5 VUs, 6 complete and 0 interrupted iterations
matinee   [  23% ] 5/5 VUs  0m15.3s/1m07.0s

running (0m17.0s), 5/5 VUs, 7 complete and 0 interrupted iterations
matinee   [  24% ] 5/5 VUs  0m16.4s/1m07.0s

running (0m18.0s), 5/5 VUs, 8 complete and 0 interrupted iterations
matinee   [  26% ] 5/5 VUs  0m17.3s/1m07.0s

running (0m19.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
matinee   [  27% ] 5/5 VUs  0m18.3s/1m07.0s

running (0m20.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
matinee   [  29% ] 5/5 VUs  0m19.4s/1m07.0s

running (0m21.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
matinee   [  30% ] 5/5 VUs  0m20.4s/1m07.0s

running (0m22.0s), 5/5 VUs, 12 complete and 0 interrupted iterations
matinee   [  32% ] 5/5 VUs  0m21.3s/1m07.0s

running (0m23.0s), 5/5 VUs, 12 complete and 0 interrupted iterations
matinee   [  33% ] 5/5 VUs  0m22.3s/1m07.0s

running (0m24.0s), 5/5 VUs, 13 complete and 0 interrupted iterations
matinee   [  35% ] 5/5 VUs  0m23.4s/1m07.0s

running (0m25.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
matinee   [  36% ] 5/5 VUs  0m24.3s/1m07.0s

running (0m26.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
matinee   [  38% ] 5/5 VUs  0m25.3s/1m07.0s

running (0m27.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
matinee   [  39% ] 5/5 VUs  0m26.3s/1m07.0s

running (0m28.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
matinee   [  41% ] 5/5 VUs  0m27.3s/1m07.0s

running (0m29.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
matinee   [  42% ] 5/5 VUs  0m28.4s/1m07.0s

running (0m30.0s), 5/5 VUs, 19 complete and 0 interrupted iterations
matinee   [  44% ] 5/5 VUs  0m29.3s/1m07.0s

running (0m31.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
matinee   [  45% ] 5/5 VUs  0m30.3s/1m07.0s

running (0m32.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
matinee   [  47% ] 5/5 VUs  0m31.3s/1m07.0s

running (0m33.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
matinee   [  48% ] 5/5 VUs  0m32.3s/1m07.0s

running (0m34.0s), 5/5 VUs, 22 complete and 0 interrupted iterations
matinee   [  50% ] 5/5 VUs  0m33.4s/1m07.0s

running (0m35.0s), 5/5 VUs, 22 complete and 0 interrupted iterations
matinee   [  51% ] 5/5 VUs  0m34.4s/1m07.0s

running (0m36.0s), 5/5 VUs, 22 complete and 0 interrupted iterations
matinee   [  53% ] 5/5 VUs  0m35.3s/1m07.0s

running (0m37.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
matinee   [  54% ] 5/5 VUs  0m36.3s/1m07.0s

running (0m38.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
matinee   [  56% ] 5/5 VUs  0m37.3s/1m07.0s

running (0m39.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
matinee   [  57% ] 5/5 VUs  0m38.3s/1m07.0s

running (0m40.0s), 5/5 VUs, 26 complete and 0 interrupted iterations
matinee   [  59% ] 5/5 VUs  0m39.4s/1m07.0s

running (0m41.0s), 5/5 VUs, 27 complete and 0 interrupted iterations
matinee   [  60% ] 5/5 VUs  0m40.3s/1m07.0s

running (0m42.0s), 5/5 VUs, 27 complete and 0 interrupted iterations
matinee   [  62% ] 5/5 VUs  0m41.3s/1m07.0s

running (0m43.0s), 5/5 VUs, 27 complete and 0 interrupted iterations
matinee   [  63% ] 5/5 VUs  0m42.3s/1m07.0s

running (0m44.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
matinee   [  65% ] 5/5 VUs  0m43.3s/1m07.0s

running (0m45.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
matinee   [  66% ] 5/5 VUs  0m44.4s/1m07.0s

running (0m46.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
matinee   [  68% ] 5/5 VUs  0m45.4s/1m07.0s

running (0m47.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
matinee   [  69% ] 5/5 VUs  0m46.3s/1m07.0s

running (0m48.0s), 5/5 VUs, 31 complete and 0 interrupted iterations
matinee   [  71% ] 5/5 VUs  0m47.4s/1m07.0s

running (0m49.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
matinee   [  72% ] 5/5 VUs  0m48.4s/1m07.0s

running (0m50.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
matinee   [  74% ] 5/5 VUs  0m49.3s/1m07.0s

running (0m51.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
matinee   [  75% ] 5/5 VUs  0m50.3s/1m07.0s

running (0m52.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
matinee   [  77% ] 5/5 VUs  0m51.3s/1m07.0s

running (0m53.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
matinee   [  78% ] 5/5 VUs  0m52.4s/1m07.0s

running (0m54.0s), 5/5 VUs, 37 complete and 0 interrupted iterations
matinee   [  80% ] 5/5 VUs  0m53.3s/1m07.0s

running (0m55.0s), 5/5 VUs, 39 complete and 0 interrupted iterations
matinee   [  81% ] 5/5 VUs  0m54.4s/1m07.0s

running (0m56.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
matinee   [  83% ] 5/5 VUs  0m55.3s/1m07.0s

running (0m57.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
matinee   [  84% ] 5/5 VUs  0m56.3s/1m07.0s

running (0m58.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
matinee   [  86% ] 5/5 VUs  0m57.4s/1m07.0s

running (0m59.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
matinee   [  87% ] 5/5 VUs  0m58.4s/1m07.0s

running (1m00.0s), 5/5 VUs, 42 complete and 0 interrupted iterations
matinee   [  89% ] 5/5 VUs  0m59.4s/1m07.0s

running (1m01.0s), 4/5 VUs, 45 complete and 0 interrupted iterations
matinee   [  90% ] 4/5 VUs  1m00.4s/1m07.0s

running (1m02.0s), 4/5 VUs, 45 complete and 0 interrupted iterations
matinee   [  92% ] 4/5 VUs  1m01.3s/1m07.0s

running (1m03.0s), 3/5 VUs, 46 complete and 0 interrupted iterations
matinee   [  93% ] 3/5 VUs  1m02.4s/1m07.0s

running (1m04.0s), 3/5 VUs, 46 complete and 0 interrupted iterations
matinee   [  95% ] 3/5 VUs  1m03.3s/1m07.0s

running (1m05.0s), 3/5 VUs, 47 complete and 0 interrupted iterations
matinee   [  96% ] 3/5 VUs  1m04.3s/1m07.0s

running (1m06.0s), 2/5 VUs, 48 complete and 0 interrupted iterations
matinee   [  98% ] 2/5 VUs  1m05.3s/1m07.0s

running (1m07.0s), 2/5 VUs, 49 complete and 0 interrupted iterations
matinee   [  99% ] 2/5 VUs  1m06.4s/1m07.0s

running (1m08.0s), 2/5 VUs, 49 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 2/5 VUs  1m7s

running (1m09.0s), 2/5 VUs, 49 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 2/5 VUs  1m7s

running (1m10.0s), 2/5 VUs, 49 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 2/5 VUs  1m7s

running (1m11.0s), 2/5 VUs, 49 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 2/5 VUs  1m7s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{name:login}
    ✓ 'p(95)<3000' p(95)=229.27ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    klassio_dossier_eleve
    ✓ 'p(95)<500' p(95)=17.52ms

    klassio_liste_eleves
    ✓ 'p(95)<1500' p(95)=101.33ms

    klassio_rapports
    ✓ 'p(95)<1200' p(95)=171.7ms

    klassio_tableau_de_bord
    ✓ 'p(95)<800' p(95)=108.67ms


  █ TOTAL RESULTS 

    checks_total.......: 765     10.670861/s
    checks_succeeded...: 100.00% 765 out of 765
    checks_failed......: 0.00%   0 out of 765

    ✓ tableau de bord : 200
    ✓ tableau de bord : champs attendus
    ✓ élèves : 200
    ✓ élèves : liste non vide
    ✓ élèves : champ « code » présent
    ✓ dossier : 200
    ✓ dossier : champs attendus
    ✓ rapports : 200
    ✓ rapports : champs attendus
    ✓ classes : 200
    ✓ classes : liste non vide
    ✓ classes : champ « name » présent
    ✓ enfants : 200
    ✓ enfants : liste non vide
    ✓ enfants : champ « code » présent

    CUSTOM
    klassio_dossier_eleve..........: med=12.63ms  p(90)=16.24ms  p(95)=17.52ms  p(99)=26.86ms  max=27.21ms 
    klassio_liste_eleves...........: med=71.8ms   p(90)=88.81ms  p(95)=101.33ms p(99)=149.75ms max=167.51ms
    klassio_rapports...............: med=72.3ms   p(90)=109.35ms p(95)=171.7ms  p(99)=358.06ms max=495.84ms
    klassio_tableau_de_bord........: med=53.79ms  p(90)=86.58ms  p(95)=108.67ms p(99)=172.58ms max=213.95ms

    HTTP
    http_req_duration..............: med=23.8ms   p(90)=76.36ms  p(95)=97.97ms  p(99)=213.03ms max=495.84ms
      { expected_response:true }...: med=23.8ms   p(90)=76.36ms  p(95)=97.97ms  p(99)=213.03ms max=495.84ms
      { name:login }...............: med=213.28ms p(90)=227.49ms p(95)=229.27ms p(99)=230.69ms max=231.05ms
    http_req_failed................: 0.00% 0 out of 411
    http_reqs......................: 411   5.732972/s

    EXECUTION
    iteration_duration.............: med=5.92s    p(90)=7.06s    p(95)=7.41s    p(99)=7.92s    max=8.1s    
    iterations.....................: 51    0.711391/s
    vus............................: 2     min=1        max=5
    vus_max........................: 5     min=5        max=5

    NETWORK
    data_received..................: 41 MB 567 kB/s
    data_sent......................: 66 kB 923 B/s



running (1m11.7s), 0/5 VUs, 51 complete and 0 interrupted iterations
matinee ✓ [ 100% ] 0/5 VUs  1m7s